<?php
    /**
     * @package Pirkei_Avos
     * @version 1.2
     */
    /*
     Plugin Name: Pirkei Avos
     Plugin URI: https://wordpress.org/plugins/pirkei-avos/
     Description: Frum version of Hello Dolly. Enjoy!
     Author: Benny Powers
     Version: 1.2
     Author URI: http://bennypowers.com/
     */

    function pirkei_avos_get_quote() {
/** These are some lines from Pirkei Avos */
$quotes = "משה קיבל תורה מסיניי ומסרה ליהושוע ויהושוע לזקנים וזקנים לנביאים ונביאים מסרוה לאנשי כנסת הגדולה
והן אמרו שלושה דברים היו מתונים בדין והעמידו תלמידים הרבה ועשו סייג לתורה
שמעון הצדיק היה משיירי אנשי כנסת הגדולה הוא היה אומר על שלושה דברים העולם עומד על התורה ועל העבודה ועל גמילות החסדים
אנטיגנוס איש סוכו קיבל משמעון הצדיק הוא היה אומר אל תהיו כעבדים המשמשין את הרב על מנת לקבל פרס
אלא הוו כעבדים המשמשין את הרב על מנת שלא לקבל פרס ויהי מורא שמיים עליכם
יוסי בן יועזר איש צרידה ויוסף בן יוחנן איש ירושלים קיבלו ממנו
יוסי בן יועזר איש צרידה אומר יהי ביתך בית ועד לחכמים
והוי מתאבק בעפר רגליהם ושותה בצמא את דבריהם
יוסי בן יוחנן איש ירושלים אומר יהי ביתך פתוח לרווחה ויהיו עניים בני ביתך
ואל תרבה שיחה עם האישה באשתו אמרו קל וחומר באשת חברו
מכאן אמרו חכמים כל המרבה שיחה עם האישה גורם רעה לעצמו ובטיל מדברי תורה וסופו יירש גיהינם
יהושוע בן פרחיה וניתאי הארבלי קיבלו מהם
יהושוע בן פרחיה אומר עשה לך רב וקנה לך חבר והוי דן את כל האדם לכף זכות
ניתאי הארבלי אומר הרחק משכן רע ואל תתחבר לרשע ואל תתייאש מן הפורענות
יהודה בן טבאי ושמעון בן שטח קיבלו מהם יהודה בן טבאי אומר אל תעש עצמך כעורכי הדיינים וכשיהיו בעלי הדין עומדין לפניך יהיו בעיניך כרשעים וכשנפטרים מלפניך יהיו בעיניך כזכאים שקיבלו עליהן את הדין
שמעון בן שטח אומר הוי מרבה לחקור את העדים והוי זהיר בדבריך שמא מתוכן ילמדו לשקר
שמעיה ואבטליון קיבלו מהם שמעיה אומר אהוב את המלאכה ושנוא את הרבנות ואל תתוודע לרשות
אבטליון אומר חכמים היזהרו בדבריכם שמא תחובו חובת גלות ותגלו למקום המים הרעים וישתו התלמידים הבאים אחריכם וימותו ונמצא שם שמיים מתחלל
הלל ושמאי קיבלו מהם הלל אומר הוי כתלמידיו של אהרון אוהב שלום ורודף שלום אוהב את הברייות ומקרבן לתורה
הוא היה אומר נגד שמא אבד שמא דילא מוסיף יסוף ודילא יליף קטלא חייב ודישתמש בתגא חלף
הוא היה אומר אם אין אני לי מי לי וכשאני לעצמי מה אני ואם לא עכשיו אימתיי
שמאי אומר עשה תורתך קבע אמור מעט ועשה הרבה והוי מקביל את כל האדם בסבר פנים יפות
רבן גמליאל אומר עשה לך רב והסתלק מן הספק ואל תרבה לעשר אומדות
שמעון בנו אומר כל ימיי גדלתי בין החכמים ולא מצאתי לגוף טוב אלא שתיקה ולא המדרש הוא העיקר אלא המעשה וכל המרבה דברים מביא חטא
רבן שמעון בן גמליאל אומר על שלושה דברים העולם קיים על הדין ועל האמת ועל השלום
רבי אומר איזו היא דרך ישרה שיבור לו האדם כל שהיא תפארת לעושיה ותפארת לו מן האדם והוי זהיר במצוה קלה כמצוה חמורה שאין אתה יודע מתן שכרן של מצוות והוי מחשב הפסד מצוה כנגד שכרה ושכר עבירה כנגד הפסדה
והסתכל בשלושה דברים ואין אתה בא לידי עבירה דע מה למעלה ממך עין רואה ואוזן שומעת וכל מעשיך בספר נכתבין
רבן גמליאל בנו של רבי יהודה הנשיא אומר יפה תלמוד תורה עם דרך ארץ שיגיעת שניהם משכחת עוון
וכל תורה שאין עימה מלאכה סופה בטילה וגוררת עוון
וכל העמלים עם הציבור יהיו עמלים עימם לשם שמיים שזכות אבותן מסייעתן וצדקתם עומדת לעד ואתם מעלה אני עליכם כאילו עשיתם
הוו זהירין ברשות שאין מקרבין לו לאדם אלא לצורך עצמן נראין כאוהבין בשעת הנאתן ואין עומדין לו לאדם בשעת דוחקו
הוא היה אומר עשה רצונו כרצונך כדי שיעשה רצונך כרצונו בטל רצונך מפני רצונו כדי שיבטל רצון אחרים מפני רצונך
הלל אומר אל תפרוש מן הציבור ואל תאמין בעצמך עד יום מותך
ואל תדון את חברך עד שתגיע למקומו ואל תאמר דבר שאי אפשר לשמוע וסופו להישמע
ואל תאמר לכשאפנה אשנה שמא לא תפנה
הוא היה אומר אין בור ירא חטא ולא עם הארץ חסיד
ולא הביישן למד ולא הקפדן מלמד
ולא כל המרבה בסחורה מחכים
ובמקום שאין אנשים השתדל להיות איש
אף הוא ראה גולגולת אחת צפה על פני המים
אמר לה על דאטיפת אטיפוך וסוף מטיפייך יטופון
הוא היה אומר מרבה בשר מרבה רימה מרבה נכסים מרבה דאגה
מרבה עבדים מרבה גזל מרבה שפחות מרבה זימה
מרבה נשים מרבה כשפים
מרבה תורה מרבה חיים מרבה ישיבה מרבה חכמה
קנה שם טוב קנה לו לעצמו
קנה דברי תורה קנה חיי העולם הבא
רבן יוחנן בן זכאי קיבל מהלל ומשמאי
הוא היה אומר אם עשית תורה הרבה אל תחזיק טובה לעצמך כי לכך נוצרת
חמישה תלמידים היו לו לרבן יוחנן בן זכאי ואלו הן רבי אליעזר בן הורקנוס ורבי יהושוע בן חנניה ורבי יוסי הכוהן ורבי שמעון בן נתנאל ורבי אלעזר בן ערך הוא היה מונה שבחן רבי אליעזר בן הורקנוס בור סיד שאינו מאבד טיפה יהושוע בן חנניה אשרי יולדתו יוסי הכוהן חסיד שמעון בן נתנאל ירא חטא אלעזר בן ערך מעיין המתגבר
הוא היה אומר אם יהיו כל חכמי ישראל בכף מאזניים ואליעזר בן הורקנוס בכף שנייה מכריע את כולם
אבא שאול אומר משמו אם יהיו כל חכמי ישראל בכף מאזניים ואליעזר בן הורקנוס אף עימהםואלעזר בן ערך בכף שנייה מכריע הוא את כולם
אמר להם צאו וראו איזו היא דרך טובה שידבק בה האדם רבי אליעזר אומר עין טובה רבי יהושוע אומר חבר טוב רבי יוסי אומר שכן טוב רבי שמעון אומר הרואה את הנולד רבי אלעזר אומר לב טוב
אמר להם רואה אני את דברי אלעזר בן ערך מדבריכם שבכלל דבריו דבריכם
חזר ואמר להם צאו וראו איזו היא דרך רעה שיתרחק ממנה האדם רבי אליעזר אומר עין רעה רבי יהושוע אומר חבר רע רבי יוסי אומר שכן רע
רבי שמעון אומר הלווה ואינו משלם אחד לווה מן האדם כלווה מן המקום ברוך הוא שנאמר לווה רשע ולא ישלם וצדיק חונן ונותן רבי אלעזר אומר לב רע אמר להם רואה אני את דברי אלעזר בן ערך מדבריכם שבכלל דבריו דבריכם
הם אמרו שלושה שלושה דברים
רבי אליעזר אומר יהי כבוד חברך חביב עליך כשלך
ואל תהי נוח לכעוס ושוב יום אחד לפני מיתתך
והוי מתחמם כנגד אורן של חכמים והוי זהיר מגחלתן שמא תיכווה שנשיכתן נשיכת שועל ועקיצתן עקיצת עקרב ולחישתן לחישת שרף וכל דבריהם כגחלי אש
רבי יהושוע אומר עין רעה ויצר הרע ושנאת הברייות מוציאין את האדם מן העולם
רבי יוסי אומר יהי ממון חברך חביב עליך כשלך
התקן עצמך ללמוד תורה שאינה ירושה לך וכל מעשיך יהיו לשם שמיים
רבי שמעון אומר הוי זהיר בקרית שמע ובתפילה וכשאתה מתפלל אל תעש תפילתך קבע אלא תחנונים לפני המקום ברוך הוא שנאמר כי חנון ורחום הוא ואל תהי רשע בפני עצמך
רבי אלעזר אומר הוי שקד ללמוד מה שתשיב את אפיקורוס ודע לפני מי אתה עמל ומי הוא בעל מלאכתך
רבי טרפון אומר היום קצר והמלאכה מרובה והפועלים עצלים והשכר הרבה ובעל הבית דוחק
הוא היה אומר לא עליך כל המלאכה לגמור ולא אתה בן חורין ליבטל
אבל אם למדת תורה הרבה נותנין לך שכר הרבה
ונאמן הוא בעל מלאכתך שישלם לך שכר פעולתך
ודע שמתן שכרן של צדיקים לעתיד לבוא
עקביה בן מהללאל אומר הסתכל בשלושה דברים ואין אתה בא לידי עבירה
דע מאיין באת ולאיין אתה הולך ולפני מי אתה עתיד ליתן דין וחשבון
מאיין באת מליחה סרוחה
ולאיין אתה הולך למקום רימה ותולעה
ולפני מי אתה עתיד ליתן דין וחשבון לפני מלך מלכי המלכים הקדוש ברוך הוא
רבי חנניה סגן הכוהנים אומר הוי מתפלל בשלומה של מלכות שאלמלא מוראה איש את ריעהו חיים בלעו
רבי חנניה בן תרדיון אומר שניים שהיו יושבין ואין ביניהן דברי תורה הרי זה מושב לצים שנאמר ובמושב לצים לא ישב
אבל שניים שהיו יושבין ועוסקין בדברי תורה שכינה עימהם שנאמר אז נדברו יראי ה איש אל ריעהו ויקשב ה וישמע
ומניין לאחד שיושב ודורש כאילו קיים את כל התורה שנאמר יישב בדד ויידום
רבי שמעון אומר שלושה שאכלו על שולחן אחד ולא אמרו עליו דברי תורה כאילו אכלו מזבחי מתים שנאמר כי כל שולחנות מלאו קיא צואה בלי מקום
אבל שלושה שאכלו על שולחן אחד ואמרו עליו דברי תורה כאילו אכלו משולחנו של מקום ברוך הוא שנאמר וידבר אליי זה השולחן אשר לפני ה
חנניה בן חכינאי אומר הניעור בלילה והמהלך בדרך יחידי והמפנה ליבו להבטלה הרי זה מתחייב בנפשו
רבי נחוניה בן הקנה אומר כל המקבל עליו עול תורה מעבירין ממנו עול מלכות ועול דרך ארץ
וכל הפורק ממנו עול תורה נותנין עליו עול מלכות ועול דרך ארץ
רבי חלפתא איש כפר חנניה אומר עשרה שהיו יושבין ועוסקין בתורה שכינה עימהן שנאמר אלוהים ניצב בעדת אל
ומניין שאפילו חמישה שנאמר ואגודתו על ארץ יסדה
ומניין שאפילו שלושה שנאמר בקרב אלוהים ישפוט
ומניין שאפילו שניים שנאמר אז נדברו יראי ה איש אל ריעהו
ומניין שאפילו אחד שנאמר בכל המקום אשר אזכיר את שמי אבוא אליך ובירכתיך
רבי אלעזר בן יהודה איש ברתותא אומר תן לו משלו שאת ושלך שלו
וכן הוא אומר בדויד כי ממך הכול ומידך נתנו לך
רבי יעקוב אומר המהלך בדרך ושונה ומפסיק משנתו ואומר מה נאה אילן זה מה נאה ניר זה מעלין עליו כאילו הוא מתחייב בנפשו
רבי דוסתאי ברבי ינאי אומר משום רבי מאיר כל השוכח דבר אחד ממשנתו מעלין עליו כאילו הוא מתחייב בנפשו שנאמר רק הישמר לך ושמור נפשך מאוד פן תשכח את הדברים
יכול אפילו תקפה עליו משנתו
תלמוד לומר ופן יסורו מלבבך  הא אינו מתחייב בנפשו עד שיישב לו ויסירם מליבו
רבי חנניה בן דוסא אומר כל שיראת חטאו קודמת לחכמתו חכמתו מתקיימת
וכל שחכמתו קודמת ליראת חטאו אין חכמתו מתקיימת
הוא היה אומר כל שמעשיו מרובין מחכמתו חכמתו מתקיימת
וכל שחכמתו מרובה ממעשיו אין חכמתו מתקיימת
הוא היה אומר כל שרוח הברייות נוחה הימנו רוח המקום נוחה הימנו
אין רוח הברייות נוחה הימנו אין רוח המקום נוחה הימנו
רבי דוסא בן הרכינס אומר שינה של שחרית ויין של צוהריים ושיחת הילדים וישיבת כנסייות של עמי הארץ מוציאין את האדם מן העולם
רבי אלעזר המודעי אומר המחלל את הקודשים והמבזה את המועדות והמפר בריתו של אברהם אבינו והמלבין פני חברו ברבים והמגלה פנים בתורה אף על פי שיש בידו מעשים טובים אין לו חלק לעולם הבא
רבי ישמעאל אומר הוי קל לראש ונוח לתשחורת והוי מקביל את כל האדם בשמחה
רבי עקיבה אומר שחוק וקלות ראש מרגילין לערווה
הוא היה אומר מסורת סייג לתורה נדרים סייג לפרישות
סייג לחכמה שתיקה
הוא היה אומר חביב אדם שנברא בצלם
חיבה יתרה נודעת לו שנברא בצלם שנאמר כי בצלם אלוהים עשה את האדם
חביבין ישראל שנקראו בנים למקום
חיבה יתרה נודעת להם שנקראו בנים למקום שנאמר בנים אתם לה אלוהיכם
חביבין ישראל שניתן להם כלי שבו נברא העולם
חיבה יתרה נודעת להם שניתן להם כדי שבו נברא העולם שנאמר כי לקח טוב נתתי לכם
הכול צפוי והרשות נתונה ובטוב העולם נידון והכול לפי רוב המעשה אבל לא על פי המעשה
הוא היה אומר הכול נתון בעירבון והמצודה פרוסה על כל החיים
והחנות פתוחה והחנווני מקיף והפנקס פתוחה והיד כותבת וכל הרוצה ללוות בא ולווה
והגבאין מחזרין תמיד בכל יום ונפרעין מן האדם לדעתו ושלא לדעתו ויש להם על מה שיסמוכו והדין דין אמת והכול מתוקן לסעודה
רבי אלעזר בן עזריה אומר אם אין תורה אין דרך ארץ
אם אין דרך ארץ אין תורה
אם אין חכמה אין יראה
אם אין יראה אין חכמה
אם אין דעת אין בינה
אם אין בינה אין דעת
אם אין קמח אין תורה
אם אין תורה אין קמח
הוא היה אומר כל שחכמתו מרובה ממעשיו למה הוא דומה לאילן שענפיו מרובין ושורשיו מועטין והרוח באה ועוקרתו והופכתו על פניו
וכל שמעשיו מרובין מחכמתו למה הוא דומה לאילן שענפיו מועטין ושורשיו מרובין
אפילו כל הרוחות שבעולם באות ונושבות בו אין מזיזות אותו ממקומו
בן זומא אומר איזה הוא חכם הלמד מכל אדם שנאמר מכל מלמדיי השכלתי
איזה הוא גיבור הכובש את יצרו שנאמר טוב ארך אפיים מגיבור
איזה הוא עשיר השמח בחלקו שנאמר יגיע כפיך כי תאכל אשריך וטוב לך אשריך בעולם הזה וטוב לך לעולם הבא
איזה הוא מכובד המכבד את הברייות שנאמר כי מכבדיי אכבד ובוזיי ייקלו
בן עזאי אומר הוי רץ למצוה קלה וברח מן העבירה שמצוה גוררת מצוה ועבירה גוררת עבירה ששכר מצוה מצוה ושכר עבירה עבירה
הוא היה אומר אל תהי בז לכל אדם ואל תהי מפליג לכל דבר שאין לך אדם שאין לו שעה ואין לך דבר שאין לו מקום
רבי לוויטס איש יבנה אומר מאוד מאוד הוי שפל רוח שתקוות אנוש רימה
רבי יוחנן בן ברוקה אומר כל המחלל שם שמיים בסתר נפרעין ממנו בגלוי
אחד שוגג ואחד מזיד בחילול השם
רבי ישמעאל בנו אומר הלמד על מנת ללמד מספיקין בידו ללמוד וללמד
והלמד על מנת לעשות מספיקין בידו ללמוד וללמד ולעשות
רבי צדוק אומר לא תעשם עטרה להתגדל בהם ולא קורדום לחפור בהם
כך היה הלל אומר ודישתמש בתגא חלף הא כל הנהנה מדברי תורה נטל חייו מן העולם
רבי יוסי אומר כל המכבד את התורה גופו מכובד על הברייות וכל המחלל את התורה גופו מחולל על הברייות
רבי ישמעאל בנו אומר החושך עצמו מן הדין פורק ממנו איבה וגזל ושבועת שוא והגס ליבו בהוראה שוטה רשע וגס רוח
הוא היה אומר אל תהי דן יחידי שאין דן יחידי אלא אחד ואל תאמר קבלו דעתי שהן רשאין ולא אתה
רבי יונתן אומר כל המקיים את התורה מעוני סופו לקיימה מעושר וכל המבטל את התורה מעושר סופו לבטלה מעוני
רבי מאיר אומר הוי מעט עוסק ועסוק בתורה ושפל רוח בפני כל אדם ואם בטלת מן התורה יש לו בטילים הרבה כנגדך ואם עמלת בתורה יש לו שכר הרבה ליתן לך
רבי אליעזר בן יעקוב אומר העושה מצוה אחת קנה לו פרקליט אחד והעובר עבירה אחת קנה לו קטיגור אחד תשובה ומעשים טובים כתריס לפני הפורענות
רבי יוחנן הסנדלר אומר כל כניסה שהיא לשם שמיים סופה להתקיים ושאינה לשם שמיים אין סופה להתקיים
רבי אלעזר אומר יהי כבוד תלמידך חביב עליך ככבוד חברך וכבוד חברך כמורא רבך ומורא רבך כמורא שמיים
רבי יהודה אומר הוי זהיר בתלמוד ששגגת התלמוד עולה זדון
רבי שמעון אומר שלושה כתרים הן כתר תורה וכתר כהונה וכתר מלכות וכתר שם טוב עולה על גביהן
רבי נהוראי אומר הוי גולה למקום תורה ואל תאמר שהיא תבוא אחריי שחבריך יקיימוה בידך ואל בינתך אל תישען
רבי ינאי אומר אין בידינו לא משלוות רשעים ואף לא מייסורי צדיקים
רבי מתיה בן חרש אומר הוי מקדים לשלום כל אדם והוי זנב לאריות ואל תהי ראש לשועלים
רבי יעקוב אומר העולם הזה דומה לפרוזדוד בפני העולם הבא התקן עצמך בפרוזדוד כדי שתיכנס לטרקלין
הוא היה אומר יפה שעה אחת בתשובה ומעשים טובים בעולם הזה כחיי העולם הבא יפה שעה אחת של קורת רוח בעולם הבא מכל חיי העולם הזה
רבי שמעון בן אלעזר אומר אל תרצה את חברך בשעת כעסו ואל תנחמנו בשעה שמתו מוטל לפניו ואל תשאל לו בשעת נדרו ואל תשתדל לראותו בשעת קלקלתו
שמואל הקטן אומר בנפול אויבך אל תשמח חרון אפו לא נאמר אלא אפו
אלישע בן אבא אומר הלמד תורה ילד למה הוא דומה לדיו כתובה על נייר חדש והלמד זקן למה הוא דומה לדיו כתובה על נייר מחוק
רבי יוסי ברבי יהודה איש כפר הבבלי אומר הלמד מן הקטנים למה הוא דומה לאוכל ענבים קהות ושותה יין מגיתו והלמד מן הזקנים למה הוא דומה לאוכל ענבים בשלות ושותה יין ישן
רבי אומר אל תסתכל בקנקן אלא במה שיש בו יש קנקן חדש מלא ישן וישן אפילו חדש אין בו
רבי אליעזר הקפר אומר הקנאה והתאווה והכבוד מוציאין את האדם מן העולם
הוא היה אומר היילודים למות והמתים לחיות והחיים לידון לידע ולהודיע להיוודע שהוא היוצר והוא הבורא והוא המבין והוא הדיין והוא עד והוא בעל דין והוא עתיד לדון שאין לפניו לא עוולה ולא שכחה ולא משוא פנים ולא מקח שוחד שהכול שלו ודע שהכול בא לחשבון ואל יבטיחך יצרך שבשאול בית מנוס שעל כורחך אתה נוצר ועל כורחך אתה נולד ועל כורחך אתה חי ועל כורחך אתה מת ועל כורחך אתה עתיד ליתן דין וחשבון לפני מלך מלכי המלכים הקדוש ברוך הוא
בעשרה מאמרות נברא העולם ומה תלמוד לומר והלוא במאמר אחד יכול להיבראות אלא להיפרע מן הרשעים שהן מאבדין את העולם שנברא בעשרה מאמרות וליתן שכר טוב לצדיקים שהן מקיימין את העולם שנברא בעשרה מאמרות
עשרה דורות מאדם ועד נוח להודיע כמה ארך אפיים לפניושכל הדורות היו מכעיסין לפניו עד שהביא עליהם את מי המבול
עשרה דורות מנוח ועד אברהם להודיע כמה ארך אפיים לפניושכל הדורות היו מכעיסין ובאין עד שבא אברהם אבינו וקיבל שכר כולם
עשרה נסיונות נתנסה אברהם אבינו ועמד בכולם להודיע כמה חיבתו של אברהם אבינו
עשרה ניסים נעשו לאבותינו במצריים ועשרה על הים
עשר מכות הביא הקדוש ברוך הוא על המצריים במצריים ועשרה על הים
עשרה נסיונות ניסו אבותינו את המקום במדבר שנאמר וינסו אותי זה עשר פעמים ולא שמעו בקולי
עשרה ניסים נעשו בבית המקדש לא הפילה אישה מריח בשר הקודש ולא הסריח בשר הקודש מעולם ולא אירע קרי לכוהן גדול ביום הכיפורים ולא נראה זבוב בבית המטבחיים ולא נמצא פסול בעומר ובשתי הלחם ובלחם הפנים ולא כבו הגשמים את עצי המערכה ולא נצחה הרוח את עמוד העשן עומדים צפופים ומשתחווים רווחים ולא הזיק נחש ועקרב בירושלים מעולם ולא אמר אדם לחברו צר לי המקום שאלין בירושלים
עשרה דברים נבראו בין השמשות פי הארץ פי הבאר פי האתון והקשת והמן והמטה והשמיר והכתב והמכתב והלוחות ויש אומרין אף המזיקין וקבורתו של משה ואילו של אברהם ויש אומרין אף צבת בצבת עשויה שבעה דברים בגולם ושבעה בחכם
חכם אינו מדבר לפני מי שהוא גדול ממנו בחכמה ואינו נכנס לתוך דברי חברו ואינו נבהל להשיבש ואל כהלכה ומשיב כעניין ואומר על ראשון ראשון ועל אחרון אחרון ועל מה שלא שמע אומר לא שמעתיו מודה על האמת וחילופיהן בגולם
שבעה מיני פורענייות באין על שבעה גופי עבירות מקצתן מעשרין ומקצתן שאינן מעשרין רעב של בצורת בא מקצתן רעבים ומקצתן שבעים גמרו שלא לעשר רעב של מהומה ושל בצורת בא שלא ליטול חלה רעב של כליה בא
דבר בא לעולם על מיתות האמורות בתורה שלא נמסרו לבית דין ועל פירות שביעית
חרב באה לעולם על עינוי הדין ועל עיוות הדין ועל המורים בתורה שלא כהלכה
חיה רעה באה לעולם על שבועת שוא ועל חילול השם
גלות באה לעולם על עבודה זרה ועל גילוי עריות ועל שפיכות דמים ועל שמיטת הארץ
בארבעה פרקים הדבר מרובה ברביעית ובשביעית ובמוצאי שביעית ובמוצאי החג שבכל שנה ברביעית מפני מעשר עני שבשלישית בשביעית מפני מעשר עני שבשישית במוצאי שביעית מפני פירות שביעית במוצאי החג שבכל שנה ושנה מפני גזל מתנות עניים
ארבע מידות באדם האומר שלי שלי ושלך שלך זו מידה בינונית ויש אומרין זו מידת סדום שלי שלך ושלך שלי עם הארץ שלי שלך ושלך שלך חסיד שלך שלי ושלי שלי רשע
ארבע מידות בדעות נוח לכעוס ונוח לרצות יצא הפסדו בשכרו קשה לכעוס וקשה לרצות יצא שכרו בהפסדו קשה לכעוס ונוח לרצות חסיד נוח לכעוס וקשה לרצות רשע
ארבע מידות בתלמידים ממהר לשמוע וממהר לאבד יצא שכרו בהפסדו קשה לשמוע וקשה לאבד יצא הפסדו בשכרו ממהר לשמוע וקשה לאבד חכם קשה לשמוע וממהר לאבד זה חלק רע
ארבע מידות בנותני צדקה רוצה שייתן ולא ייתנו אחרים עינו רעה בשל אחרים שייתנו אחרים והוא לא ייתן עינו רעה בשלו שייתן וייתנו אחרים חסיד לא ייתן ולא ייתנו אחרים רשע
ארבע מידות בהולכי לבית המדרש הולך ואינו עושה שכר הליכה בידו עושה ואינו הולך שכר מעשה בידו הולך ועושה חסיד לא הולך ולא עושה רשע
ארבע מידות ביושבי לפני חכמים ספוג ומשפך משמרת ונפה ספוג שהוא סופג את הכול משפך שהוא מכניס בזו ומוציא בזו משמרת שהיא מוציאה את היין וקולטת את השמרים ונפה שהיא מוציאה את הקמח וקולטת את הסולת
כל אהבה שהיא תלויה בדבר בטל דבר בטלה אהבה ושאינה תלויה בדבר אינה בטילה לעולם
איזו היא אהבה שהיא תלויה בדבר זו אהבת אמנון ותמר ושאינה תלויה בדבר זו אהבת דויד ויהונתן
כל מחלוקת שהיא לשם שמיים סופה להתקיים ושאינה לשם שמיים אין סופה להתקיים
איזו היא מחלוקת שהיא לשם שמיים זו מחלוקת הלל ושמאי ושאינה לשם שמיים זו מחלוקת קורח ועדתו כל המזכה את הרבים אין חטא בא על ידו וכל המחטיא את הרבים אין מספיקין בידו לעשות תשובה
משה זכה וזיכה את הרבים וזכות הרבים תלויה בו שנאמר צדקת ה עשה ומשפטיו עם ישראל
ירבעם חטא והחטיא את הרבים וחטאת הרבים תלויה בו שנאמר על חטאות ירובעם אשר חטא ואשר החטיא את ישראל
כל מי שיש בו שלושה דברים הללו הרי זה מתלמידיו של אברהם וכל מי שאין בו שלושה דברים הללו הרי זה מתלמידיו של בלעם
תלמידיו של אברהם עין טובה ונפש שפלה ורוח נמוכה אבל תלמידיו של בלעם עין רעה ונפש רחבה ורוח גבוהה
מה בין תלמידיו של אברהם לתלמידיו של בלעם תלמידיו של בלעם יורדין לגיהינם ונוחלין באר שחת שנאמר ואתה אלוהים תורידם לבאר שחת אנשי דמים ומרמה אבל תלמידיו של אברהם יורשין גן עדן שנאמר להנחיל אוהביי יש ואוצרותיהם אמלא
יהודה בן תימא אומר הוי עז כנמר וקל כנשר ורץ כצבי וגיבור כארי לעשות רצון אביך שבשמיים
הוא היה אומר עז פנים לגיהינם ובוש פנים לגן עדן כן יהי רצון מלפניך ה אלוהינו שתיבנה עירך בימינו ותיתן חלקנו בתורתך ועם עושי רצונך
בן בגבג אומר הפוך בה והפך בה והגי בה דכולא בה ובה תחזי סיב ובלי בה ומינה לא תזוז שאין לך מידה טובה יותר ממנה
בן האהא אומר לפום צערא אגרא";

// Here we split it into lines
$quotes = explode( "\n", $quotes );

// And then randomly choose a line
return wptexturize( $quotes[ mt_rand( 0, count( $quotes ) - 1 ) ] );
}

// This just echoes the chosen line, we'll position it later
function pirkei_avos() {
$chosen = pirkei_avos_get_quote();
echo "<p id='avos'>$chosen</p>";
}

// Now we set that function up to execute when the admin_notices action is called
add_action( 'admin_notices', 'pirkei_avos' );

// We need some CSS to position the paragraph
function avos_css() {
// This makes sure that the positioning is also good for right-to-left languages
$x = is_rtl() ? 'left' : 'right';

echo "
<style type='text/css'>
#avos {
float: $x;
padding-$x: 15px;
padding-top: 5px;
margin: 0;
font-size: 11px;
}
</style>
";
}

add_action( 'admin_head', 'avos_css' );

    ?>
